Revit 2024 API
IFCExtrusionData.ClearLoops Method
 Clears the curve loops stored in the extrusion data.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void ClearLoops()
Visual Basic
Public Sub ClearLoops
Visual C++
public:
void ClearLoops()
See Also
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace